open-vela/nuttx/arch/risc-v/src/esp32p4/esp_dw_gdma_idf.c
/****************************************************************************
 * arch/risc-v/src/esp32p4/esp_dw_gdma_idf.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * DesignWare DW-GDMA high-level channel manager for ESP32-P4.
 *
 * The P4 display and camera pipelines push framebuffer data through the
 * DesignWare GDMA embedded in the SoC. This file manages the DMA
 * channels, the transfer descriptor (linked list item) pool and the
 * IRQ plumbing on top of the register-level HAL in esp-hal-3rdparty.
 * Buffer allocation goes through the NuttX kernel heap and interrupts
 * are attached with the chip-level IRQ helpers.
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <stdlib.h>
#include <string.h>
#include <stdint.h>
#include <stdbool.h>

#include <nuttx/kmalloc.h>
#include <nuttx/irq.h>
#include <nuttx/spinlock.h>

#include "esp_idf_shim.h"
#include "esp_dw_gdma_idf.h"
#include "esp_irq.h"
#include "esp_cache.h"

#include "soc/soc_caps.h"
#include "soc/interrupts.h"
#include "hal/dw_gdma_hal.h"
#include "hal/dw_gdma_ll.h"
#include "hal/cache_hal.h"
#include "hal/cache_ll.h"
#include "esp_private/periph_ctrl.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

ESP_LOG_ATTR_TAG(TAG, "dw-gdma");

#if SOC_CACHE_INTERNAL_MEM_VIA_L1CACHE
#define DW_GDMA_GET_NON_CACHE_ADDR(addr) \
    ((addr) ? CACHE_LL_L2MEM_NON_CACHE_ADDR(addr) : 0)
#define DW_GDMA_GET_CACHE_ADDRESS(nc_addr) \
    ((nc_addr) ? CACHE_LL_L2MEM_CACHE_ADDR(nc_addr) : 0)
#else
#define DW_GDMA_GET_NON_CACHE_ADDR(addr) (addr)
#define DW_GDMA_GET_CACHE_ADDRESS(nc_addr) (nc_addr)
#endif

#define DW_GDMA_MEM_ALLOC_CAPS    MALLOC_CAP_DEFAULT
#define DW_GDMA_ALLOW_INTR_PRIORITY_MASK ESP_INTR_FLAG_LOWMED

/****************************************************************************
 * Private Types
 ****************************************************************************/

typedef struct dw_gdma_group_t dw_gdma_group_t;
typedef struct dw_gdma_channel_t dw_gdma_channel_t;

struct dw_gdma_link_list_t {
    uint32_t num_items;
    dw_gdma_link_list_item_t *items;
    dw_gdma_link_list_item_t *items_nc;
};

typedef struct {
    spinlock_t mutex;
    dw_gdma_group_t *groups[DW_GDMA_LL_GROUPS];
    int group_ref_counts[DW_GDMA_LL_GROUPS];
} dw_gdma_platform_t;

struct dw_gdma_group_t {
    int group_id;
    dw_gdma_hal_context_t hal;
    int intr_priority;
    int cpuint;              /* NuttX: shared CPU interrupt of the group */
    portMUX_TYPE spinlock;
    dw_gdma_channel_t *channels[DW_GDMA_LL_CHANNELS_PER_GROUP];
};

struct dw_gdma_channel_t {
    int chan_id;
    int cpuint;              /* NuttX: CPU interrupt number */
    portMUX_TYPE spinlock;
    dw_gdma_group_t *group;
    void *user_data;
    dw_gdma_event_callbacks_t cbs;
    dw_gdma_block_transfer_type_t src_transfer_type;
    dw_gdma_block_transfer_type_t dst_transfer_type;
};

/****************************************************************************
 * Private Data
 ****************************************************************************/

static dw_gdma_platform_t s_platform;

/****************************************************************************
 * Private Functions
 ****************************************************************************/

static dw_gdma_group_t *dw_gdma_acquire_group_handle(int group_id)
{
  bool new_group = false;
  dw_gdma_group_t *group = NULL;
  irqstate_t flags;

  flags = spin_lock_irqsave(&s_platform.mutex);
  if (!s_platform.groups[group_id])
    {
      group = (dw_gdma_group_t *)heap_caps_calloc(
                  1, sizeof(dw_gdma_group_t), DW_GDMA_MEM_ALLOC_CAPS);
      if (group)
        {
          new_group = true;
          s_platform.groups[group_id] = group;
          PERIPH_RCC_ATOMIC()
            {
              dw_gdma_ll_enable_bus_clock(group_id, true);
              dw_gdma_ll_reset_register(group_id);
            }

          dw_gdma_hal_config_t hal_config = {};
          dw_gdma_hal_init(&group->hal, &hal_config);
        }
    }
  else
    {
      group = s_platform.groups[group_id];
    }

  if (group)
    {
      s_platform.group_ref_counts[group_id]++;
    }

  spin_unlock_irqrestore(&s_platform.mutex, flags);

  if (new_group)
    {
      portMUX_INITIALIZE(&group->spinlock);
      group->group_id = group_id;
      group->intr_priority = -1;
      group->cpuint = -1;
      ESP_LOGD(TAG, "new group (%d) at %p", group_id, group);
    }

  return group;
}

static void dw_gdma_release_group_handle(dw_gdma_group_t *group)
{
  int group_id = group->group_id;
  bool del_group = false;
  irqstate_t flags;

  flags = spin_lock_irqsave(&s_platform.mutex);
  s_platform.group_ref_counts[group_id]--;
  if (s_platform.group_ref_counts[group_id] == 0)
    {
      del_group = true;
      s_platform.groups[group_id] = NULL;
      dw_gdma_hal_deinit(&group->hal);
      PERIPH_RCC_ATOMIC()
        {
          dw_gdma_ll_enable_bus_clock(group_id, false);
        }
    }

  spin_unlock_irqrestore(&s_platform.mutex, flags);

  if (del_group)
    {
      /* The interrupt line is shared by all channels of the group, so it is
       * released only when the last channel is gone.
       */

