open-vela/nuttx/arch/risc-v/src/esp32p4/esp_dw_gdma_idf.c
      if (group->cpuint >= 0)
        {
          up_disable_irq(ESP_SOURCE2IRQ(ETS_DW_GDMA_INTR_SOURCE));
          esp_teardown_irq(ETS_DW_GDMA_INTR_SOURCE, group->cpuint);
          group->cpuint = -1;
        }

      free(group);
      ESP_LOGD(TAG, "delete group (%d)", group_id);
    }
}

static esp_err_t channel_register_to_group(dw_gdma_channel_t *chan)
{
  dw_gdma_group_t *group = NULL;
  int chan_id = -1;
  int i;
  int j;

  for (i = 0; i < DW_GDMA_LL_GROUPS; i++)
    {
      group = dw_gdma_acquire_group_handle(i);
      ESP_RETURN_ON_FALSE(group, ESP_ERR_NO_MEM, TAG,
                          "no mem for group(%d)", i);
      esp_os_enter_critical(&group->spinlock);
      for (j = 0; j < DW_GDMA_LL_CHANNELS_PER_GROUP; j++)
        {
          if (group->channels[j] == NULL)
            {
              group->channels[j] = chan;
              chan_id = j;
              break;
            }
        }

      esp_os_exit_critical(&group->spinlock);
      if (chan_id < 0)
        {
          dw_gdma_release_group_handle(group);
        }
      else
        {
          chan->group = group;
          chan->chan_id = chan_id;
          break;
        }
    }

  ESP_RETURN_ON_FALSE(chan_id >= 0, ESP_ERR_NOT_FOUND, TAG,
                      "no free channels");
  return ESP_OK;
}

static void channel_unregister_from_group(dw_gdma_channel_t *chan)
{
  dw_gdma_group_t *group = chan->group;
  int chan_id = chan->chan_id;

  esp_os_enter_critical(&group->spinlock);
  group->channels[chan_id] = NULL;
  esp_os_exit_critical(&group->spinlock);
  dw_gdma_release_group_handle(group);
}

static esp_err_t channel_destroy(dw_gdma_channel_t *chan)
{
  if (chan->group)
    {
      channel_unregister_from_group(chan);
    }

  /* The DW-GDMA interrupt is owned by the group (all channels share the
   * same interrupt source), so it is torn down in
   * dw_gdma_release_group_handle() and not here.
   */

  free(chan);
  return ESP_OK;
}

/****************************************************************************
 * ISR
 ****************************************************************************/

static void dw_gdma_channel_default_isr(dw_gdma_channel_t *chan)
{
  dw_gdma_group_t *group = chan->group;
  dw_gdma_hal_context_t *hal = &group->hal;
  int chan_id = chan->chan_id;
  uint32_t intr_status;

  /* Clear pending interrupt event */

  intr_status = dw_gdma_ll_channel_get_intr_status(hal->dev, chan_id);
  dw_gdma_ll_channel_clear_intr(hal->dev, chan_id, intr_status);

  /* Call user callbacks */

  if (intr_status & DW_GDMA_LL_CHANNEL_EVENT_SHADOWREG_OR_LLI_INVALID_ERR)
    {
      if (chan->cbs.on_invalid_block)
        {
          intptr_t invalid_lli_addr =
              dw_gdma_ll_channel_get_current_link_list_item_addr(
                  hal->dev, chan_id);
          dw_gdma_break_event_data_t edata = {
              .invalid_lli = (dw_gdma_lli_handle_t)
                  DW_GDMA_GET_NON_CACHE_ADDR(invalid_lli_addr),
          };

          chan->cbs.on_invalid_block(chan, &edata, chan->user_data);
        }
    }

  if (intr_status & DW_GDMA_LL_CHANNEL_EVENT_BLOCK_TFR_DONE)
    {
      if (chan->cbs.on_block_trans_done)
        {
          dw_gdma_trans_done_event_data_t edata = {};
          chan->cbs.on_block_trans_done(chan, &edata, chan->user_data);
        }
    }

  if (intr_status & DW_GDMA_LL_CHANNEL_EVENT_DMA_TFR_DONE)
    {
      if (chan->cbs.on_full_trans_done)
        {
          dw_gdma_trans_done_event_data_t edata = {};
          chan->cbs.on_full_trans_done(chan, &edata, chan->user_data);
        }
    }
}

/* All DW-GDMA channels share a single interrupt source. NuttX allocates
 * interrupts per source (not shared like esp_intr_alloc with
 * ESP_INTR_FLAG_SHARED), so the group installs one handler and dispatches
 * to every channel that has a pending event.
 */

static int dw_gdma_isr_wrapper(int irq, void *context, void *arg)
{
  dw_gdma_group_t *group = (dw_gdma_group_t *)arg;
  dw_gdma_hal_context_t *hal = &group->hal;
  dw_gdma_channel_t *chan;
  int i;

  (void)irq;
  (void)context;

  for (i = 0; i < DW_GDMA_LL_CHANNELS_PER_GROUP; i++)
    {
      chan = group->channels[i];
      if (chan != NULL &&
          dw_gdma_ll_channel_get_intr_status(hal->dev, i) != 0)
        {
          dw_gdma_channel_default_isr(chan);
        }
    }

  return 0;
}

static esp_err_t dw_gdma_install_channel_interrupt(dw_gdma_channel_t *chan)
{
  dw_gdma_group_t *group = chan->group;
  dw_gdma_hal_context_t *hal = &group->hal;
  int chan_id = chan->chan_id;
  int cpuint;

  /* Clear pending events */

  dw_gdma_ll_channel_enable_intr_propagation(hal->dev, chan_id,
                                             UINT32_MAX, false);
  dw_gdma_ll_channel_clear_intr(hal->dev, chan_id, UINT32_MAX);

  /* Allocate and attach the group interrupt once */

  if (group->cpuint < 0)
    {
      cpuint = esp_setup_irq(ETS_DW_GDMA_INTR_SOURCE,
                             ESP_IRQ_PRIORITY_DEFAULT,
                             ESP_IRQ_TRIGGER_LEVEL,
                             dw_gdma_isr_wrapper,
                             group);
      if (cpuint < 0)
        {
          ESP_LOGE(TAG, "alloc interrupt failed");
          return ESP_FAIL;
        }

      group->cpuint = cpuint;
      up_enable_irq(ESP_SOURCE2IRQ(ETS_DW_GDMA_INTR_SOURCE));
    }

  ESP_LOGD(TAG, "install interrupt for channel (%d,%d)",
           group->group_id, chan_id);
  chan->cpuint = group->cpuint;
  return ESP_OK;
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

esp_err_t dw_gdma_new_channel(const dw_gdma_channel_alloc_config_t *config,
                              dw_gdma_channel_handle_t *ret_chan)
{
  esp_err_t ret = ESP_OK;
  dw_gdma_channel_t *chan = NULL;

  ESP_RETURN_ON_FALSE(config && ret_chan, ESP_ERR_INVALID_ARG, TAG,
                      "invalid argument");
  ESP_RETURN_ON_FALSE(
      config->src.num_outstanding_requests >= 1 &&
      config->src.num_outstanding_requests <=
          DW_GDMA_LL_MAX_OUTSTANDING_REQUESTS,
      ESP_ERR_INVALID_ARG, TAG, "invalid num_outstanding_requests");
  ESP_RETURN_ON_FALSE(
      config->dst.num_outstanding_requests >= 1 &&
      config->dst.num_outstanding_requests <=
          DW_GDMA_LL_MAX_OUTSTANDING_REQUESTS,
      ESP_ERR_INVALID_ARG, TAG, "invalid num_outstanding_requests");
  ESP_RETURN_ON_FALSE(
      config->chan_priority >= 0 &&
      config->chan_priority < DW_GDMA_LL_CHANNELS_PER_GROUP,
      ESP_ERR_INVALID_ARG, TAG, "invalid channel priority");

