open-vela/nuttx/arch/risc-v/src/esp32p4/esp_dw_gdma_idf.c
  chan = (dw_gdma_channel_t *)heap_caps_calloc(
             1, sizeof(dw_gdma_channel_t), DW_GDMA_MEM_ALLOC_CAPS);
  ESP_RETURN_ON_FALSE(chan, ESP_ERR_NO_MEM, TAG, "no mem for channel");
  chan->cpuint = -1;

  /* Register channel to group */

  ESP_GOTO_ON_ERROR(channel_register_to_group(chan), err, TAG,
                    "register to group failed");

  dw_gdma_group_t *group = chan->group;
  dw_gdma_hal_context_t *hal = &group->hal;
  int chan_id = chan->chan_id;

  /* Check interrupt priority conflict */

  bool intr_priority_conflict = false;
  esp_os_enter_critical(&group->spinlock);
  if (group->intr_priority == -1)
    {
      group->intr_priority = config->intr_priority;
    }
  else if (config->intr_priority != 0)
    {
      intr_priority_conflict =
          (group->intr_priority != config->intr_priority);
    }

  esp_os_exit_critical(&group->spinlock);
  ESP_GOTO_ON_FALSE(!intr_priority_conflict, ESP_ERR_INVALID_STATE,
                    err, TAG, "intr_priority conflict");

  /* Basic initialization */

  portMUX_INITIALIZE(&chan->spinlock);
  chan->src_transfer_type = config->src.block_transfer_type;
  chan->dst_transfer_type = config->dst.block_transfer_type;

  /* Set transfer flow type */

  dw_gdma_ll_channel_set_trans_flow(hal->dev, chan_id,
      config->src.role, config->dst.role, config->flow_controller);

  /* Set transfer types */

  dw_gdma_ll_channel_set_src_multi_block_type(hal->dev, chan_id,
      config->src.block_transfer_type);
  dw_gdma_ll_channel_set_dst_multi_block_type(hal->dev, chan_id,
      config->dst.block_transfer_type);

  /* Set handshake interface */

  dw_gdma_ll_channel_set_src_handshake_interface(hal->dev, chan_id,
      config->src.handshake_type);
  dw_gdma_ll_channel_set_dst_handshake_interface(hal->dev, chan_id,
      config->dst.handshake_type);

  /* Set handshake peripheral */

  if (config->src.role != DW_GDMA_ROLE_MEM)
    {
      dw_gdma_ll_channel_set_src_handshake_periph(hal->dev, chan_id,
          config->src.role);
    }

  if (config->dst.role != DW_GDMA_ROLE_MEM)
    {
      dw_gdma_ll_channel_set_dst_handshake_periph(hal->dev, chan_id,
          config->dst.role);
    }

  /* Set channel priority */

  dw_gdma_ll_channel_set_priority(hal->dev, chan_id,
      config->chan_priority);

  /* Set outstanding request limits */

  dw_gdma_ll_channel_set_src_outstanding_limit(hal->dev, chan_id,
      config->src.num_outstanding_requests);
  dw_gdma_ll_channel_set_dst_outstanding_limit(hal->dev, chan_id,
      config->dst.num_outstanding_requests);

  /* Set status fetch addresses */

  dw_gdma_ll_channel_set_src_periph_status_addr(hal->dev, chan_id,
      config->src.status_fetch_addr);
  dw_gdma_ll_channel_set_dst_periph_status_addr(hal->dev, chan_id,
      config->dst.status_fetch_addr);

  /* Enable all channel events generation */

  dw_gdma_ll_channel_enable_intr_generation(hal->dev, chan_id,
      UINT32_MAX, true);

  ESP_LOGD(TAG, "new channel (%d,%d) at %p",
           group->group_id, chan_id, chan);
  *ret_chan = chan;
  return ESP_OK;

err:
  if (chan)
    {
      channel_destroy(chan);
    }

  return ret;
}

esp_err_t dw_gdma_del_channel(dw_gdma_channel_handle_t chan)
{
  ESP_RETURN_ON_FALSE(chan, ESP_ERR_INVALID_ARG, TAG, "invalid argument");
  ESP_LOGD(TAG, "del channel (%d,%d)",
           chan->group->group_id, chan->chan_id);
  return channel_destroy(chan);
}

esp_err_t dw_gdma_channel_enable_ctrl(dw_gdma_channel_handle_t chan,
                                      bool en_or_dis)
{
  ESP_RETURN_ON_FALSE(chan, ESP_ERR_INVALID_ARG, TAG, "invalid argument");
  dw_gdma_hal_context_t *hal = &chan->group->hal;
  dw_gdma_ll_channel_enable(hal->dev, chan->chan_id, en_or_dis);
  return ESP_OK;
}

esp_err_t dw_gdma_channel_suspend_ctrl(dw_gdma_channel_handle_t chan,
                                       bool enter_or_exit)
{
  ESP_RETURN_ON_FALSE(chan, ESP_ERR_INVALID_ARG, TAG, "invalid argument");
  dw_gdma_hal_context_t *hal = &chan->group->hal;
  dw_gdma_ll_channel_suspend(hal->dev, chan->chan_id, enter_or_exit);
  return ESP_OK;
}

esp_err_t dw_gdma_channel_abort(dw_gdma_channel_handle_t chan)
{
  ESP_RETURN_ON_FALSE(chan, ESP_ERR_INVALID_ARG, TAG, "invalid argument");
  dw_gdma_hal_context_t *hal = &chan->group->hal;
  dw_gdma_ll_channel_abort(hal->dev, chan->chan_id);
  return ESP_OK;
}

esp_err_t dw_gdma_channel_lock(dw_gdma_channel_handle_t chan,
                               dw_gdma_lock_level_t level)
{
  ESP_RETURN_ON_FALSE(chan, ESP_ERR_INVALID_ARG, TAG, "invalid argument");
  dw_gdma_hal_context_t *hal = &chan->group->hal;
  esp_os_enter_critical(&chan->spinlock);
  dw_gdma_ll_channel_lock(hal->dev, chan->chan_id, level);
  esp_os_exit_critical(&chan->spinlock);
  return ESP_OK;
}

esp_err_t dw_gdma_channel_unlock(dw_gdma_channel_handle_t chan)
{
  ESP_RETURN_ON_FALSE(chan, ESP_ERR_INVALID_ARG, TAG, "invalid argument");
  dw_gdma_hal_context_t *hal = &chan->group->hal;
  esp_os_enter_critical(&chan->spinlock);
  dw_gdma_ll_channel_unlock(hal->dev, chan->chan_id);
  esp_os_exit_critical(&chan->spinlock);
  return ESP_OK;
}

esp_err_t dw_gdma_channel_continue(dw_gdma_channel_handle_t chan)
{
  ESP_RETURN_ON_FALSE(chan, ESP_ERR_INVALID_ARG, TAG, "invalid argument");
  dw_gdma_hal_context_t *hal = &chan->group->hal;
  dw_gdma_ll_channel_resume_multi_block_transfer(hal->dev, chan->chan_id);
  return ESP_OK;
}

esp_err_t dw_gdma_new_link_list(const dw_gdma_link_list_config_t *config,
                                dw_gdma_link_list_handle_t *ret_list)
{
  esp_err_t ret = ESP_OK;
  dw_gdma_link_list_item_t *items = NULL;
  struct dw_gdma_link_list_t *list = NULL;
  uint32_t num_items;
  size_t i;

  ESP_RETURN_ON_FALSE(config && ret_list, ESP_ERR_INVALID_ARG, TAG,
                      "invalid argument");

  num_items = config->num_items;
  list = (struct dw_gdma_link_list_t *)heap_caps_calloc(
             1, sizeof(struct dw_gdma_link_list_t), DW_GDMA_MEM_ALLOC_CAPS);
  ESP_GOTO_ON_FALSE(list, ESP_ERR_NO_MEM, err, TAG,
                    "no mem for link list");

  /* Allocate LLI items with proper alignment */

  items = (dw_gdma_link_list_item_t *)heap_caps_aligned_calloc(
              DW_GDMA_LL_LINK_LIST_ALIGNMENT, num_items,
              sizeof(dw_gdma_link_list_item_t),
              MALLOC_CAP_INTERNAL | MALLOC_CAP_DMA);
  ESP_GOTO_ON_FALSE(items, ESP_ERR_NO_MEM, err, TAG,
                    "no mem for link list items");

  /* Cache sync: write back and invalidate so non-cached alias is clean */

  esp_cache_msync(items,
                  num_items * sizeof(dw_gdma_link_list_item_t),
                  ESP_CACHE_MSYNC_FLAG_DIR_C2M |
                  ESP_CACHE_MSYNC_FLAG_INVALIDATE |
                  ESP_CACHE_MSYNC_FLAG_UNALIGNED);

  list->num_items = num_items;
  list->items = items;
  list->items_nc = (dw_gdma_link_list_item_t *)
      DW_GDMA_GET_NON_CACHE_ADDR(items);

  /* Set up the link list chain */

  for (i = 0; i < num_items; i++)
    {
      dw_gdma_ll_lli_set_next_item_addr(list->items_nc + i,
          (uint32_t)(list->items + i + 1));
      dw_gdma_ll_lli_set_link_list_master_port(list->items_nc + i,
          DW_GDMA_LL_MASTER_PORT_MEMORY);
    }

  /* Set terminal link based on type */

  switch (config->link_type)
    {
    case DW_GDMA_LINKED_LIST_TYPE_CIRCULAR:
      dw_gdma_ll_lli_set_next_item_addr(
          list->items_nc + num_items - 1,
          (uint32_t)(list->items));
      break;
    case DW_GDMA_LINKED_LIST_TYPE_SINGLY:
      dw_gdma_ll_lli_set_next_item_addr(
          list->items_nc + num_items - 1, 0);
      break;
    }

  ESP_LOGD(TAG, "new link list @%p, items @%p", list, items);
  *ret_list = list;
  return ESP_OK;

err:
  if (list)
    {
      free(list);
    }

  if (items)
    {
      free(items);
    }

  return ret;
}

esp_err_t dw_gdma_del_link_list(dw_gdma_link_list_handle_t list)
{
  ESP_RETURN_ON_FALSE(list, ESP_ERR_INVALID_ARG, TAG, "invalid argument");
  ESP_LOGD(TAG, "del link list at %p", list);
  free(list->items);
  free(list);
  return ESP_OK;
}

esp_err_t dw_gdma_channel_use_link_list(dw_gdma_channel_handle_t chan,
                                        dw_gdma_link_list_handle_t list)
{
  ESP_RETURN_ON_FALSE(chan && list, ESP_ERR_INVALID_ARG, TAG,
                      "invalid argument");
  ESP_RETURN_ON_FALSE(
      chan->src_transfer_type == DW_GDMA_BLOCK_TRANSFER_LIST ||
      chan->dst_transfer_type == DW_GDMA_BLOCK_TRANSFER_LIST,
      ESP_ERR_INVALID_STATE, TAG, "invalid transfer type");

  dw_gdma_hal_context_t *hal = &chan->group->hal;
  int chan_id = chan->chan_id;

  dw_gdma_ll_channel_set_link_list_master_port(hal->dev, chan_id,
      DW_GDMA_LL_MASTER_PORT_MEMORY);
  dw_gdma_ll_channel_set_link_list_head_addr(hal->dev, chan_id,
      (uint32_t)(list->items));
  return ESP_OK;
}

