open-vela/nuttx/arch/risc-v/src/esp32p4/esp_dw_gdma_idf.c
dw_gdma_lli_handle_t dw_gdma_link_list_get_item(
    dw_gdma_link_list_handle_t list, int item_index)
{
  ESP_RETURN_ON_FALSE(list, NULL, TAG, "invalid argument");
  ESP_RETURN_ON_FALSE(item_index < (int)list->num_items, NULL, TAG,
                      "invalid item index");
  /* Return non-cached address */

  dw_gdma_link_list_item_t *lli = list->items_nc + item_index;
  return lli;
}

esp_err_t dw_gdma_lli_set_next(dw_gdma_lli_handle_t lli,
                               dw_gdma_lli_handle_t next)
{
  ESP_RETURN_ON_FALSE(lli && next, ESP_ERR_INVALID_ARG, TAG,
                      "invalid argument");
  dw_gdma_ll_lli_set_next_item_addr(lli,
      DW_GDMA_GET_CACHE_ADDRESS(next));
  return ESP_OK;
}

esp_err_t dw_gdma_channel_config_transfer(
    dw_gdma_channel_handle_t chan,
    const dw_gdma_block_transfer_config_t *config)
{
  ESP_RETURN_ON_FALSE(chan && config, ESP_ERR_INVALID_ARG, TAG,
                      "invalid argument");
  ESP_RETURN_ON_FALSE(
      chan->src_transfer_type != DW_GDMA_BLOCK_TRANSFER_LIST &&
      chan->dst_transfer_type != DW_GDMA_BLOCK_TRANSFER_LIST,
      ESP_ERR_INVALID_STATE, TAG, "invalid transfer type");

  dw_gdma_hal_context_t *hal = &chan->group->hal;
  int chan_id = chan->chan_id;

  dw_gdma_ll_channel_set_src_addr(hal->dev, chan_id, config->src.addr);
  dw_gdma_ll_channel_set_dst_addr(hal->dev, chan_id, config->dst.addr);
  dw_gdma_ll_channel_set_trans_block_size(hal->dev, chan_id, config->size);
  dw_gdma_ll_channel_set_src_master_port(hal->dev, chan_id,
      config->src.addr);
  dw_gdma_ll_channel_set_dst_master_port(hal->dev, chan_id,
      config->dst.addr);
  dw_gdma_ll_channel_set_src_trans_width(hal->dev, chan_id,
      config->src.width);
  dw_gdma_ll_channel_set_dst_trans_width(hal->dev, chan_id,
      config->dst.width);
  dw_gdma_ll_channel_set_src_burst_items(hal->dev, chan_id,
      config->src.burst_items);
  dw_gdma_ll_channel_set_dst_burst_items(hal->dev, chan_id,
      config->dst.burst_items);
  dw_gdma_ll_channel_set_src_burst_mode(hal->dev, chan_id,
      config->src.burst_mode);
  dw_gdma_ll_channel_set_dst_burst_mode(hal->dev, chan_id,
      config->dst.burst_mode);
  dw_gdma_ll_channel_set_src_burst_len(hal->dev, chan_id,
      config->src.burst_len);
  dw_gdma_ll_channel_set_dst_burst_len(hal->dev, chan_id,
      config->dst.burst_len);
  dw_gdma_ll_channel_enable_src_periph_status_write_back(hal->dev,
      chan_id, config->src.flags.en_status_write_back);
  dw_gdma_ll_channel_enable_dst_periph_status_write_back(hal->dev,
      chan_id, config->dst.flags.en_status_write_back);
  return ESP_OK;
}

esp_err_t dw_gdma_channel_set_block_markers(
    dw_gdma_channel_handle_t chan,
    dw_gdma_block_markers_t markers)
{
  ESP_RETURN_ON_FALSE(chan, ESP_ERR_INVALID_ARG, TAG, "invalid argument");
  ESP_RETURN_ON_FALSE(
      chan->src_transfer_type != DW_GDMA_BLOCK_TRANSFER_LIST &&
      chan->dst_transfer_type != DW_GDMA_BLOCK_TRANSFER_LIST,
      ESP_ERR_INVALID_STATE, TAG, "invalid transfer type");

  dw_gdma_hal_context_t *hal = &chan->group->hal;
  dw_gdma_ll_channel_set_block_markers(hal->dev, chan->chan_id,
      markers.en_trans_done_intr, markers.is_last, markers.is_valid);
  return ESP_OK;
}

esp_err_t dw_gdma_lli_config_transfer(
    dw_gdma_lli_handle_t lli,
    const dw_gdma_block_transfer_config_t *config)
{
  ESP_RETURN_ON_FALSE(lli && config, ESP_ERR_INVALID_ARG, TAG,
                      "invalid argument");

  dw_gdma_ll_lli_set_src_addr(lli, config->src.addr);
  dw_gdma_ll_lli_set_dst_addr(lli, config->dst.addr);
  dw_gdma_ll_lli_set_trans_block_size(lli, config->size);
  dw_gdma_ll_lli_set_src_master_port(lli, config->src.addr);
  dw_gdma_ll_lli_set_dst_master_port(lli, config->dst.addr);
  dw_gdma_ll_lli_set_src_trans_width(lli, config->src.width);
  dw_gdma_ll_lli_set_dst_trans_width(lli, config->dst.width);
  dw_gdma_ll_lli_set_src_burst_items(lli, config->src.burst_items);
  dw_gdma_ll_lli_set_dst_burst_items(lli, config->dst.burst_items);
  dw_gdma_ll_lli_set_src_burst_mode(lli, config->src.burst_mode);
  dw_gdma_ll_lli_set_dst_burst_mode(lli, config->dst.burst_mode);
  dw_gdma_ll_lli_set_src_burst_len(lli, config->src.burst_len);
  dw_gdma_ll_lli_set_dst_burst_len(lli, config->dst.burst_len);
  dw_gdma_ll_lli_enable_src_periph_status_write_back(lli,
      config->src.flags.en_status_write_back);
  dw_gdma_ll_lli_enable_dst_periph_status_write_back(lli,
      config->dst.flags.en_status_write_back);
  return ESP_OK;
}

esp_err_t dw_gdma_lli_set_block_markers(dw_gdma_lli_handle_t lli,
                                        dw_gdma_block_markers_t markers)
{
  ESP_RETURN_ON_FALSE(lli, ESP_ERR_INVALID_ARG, TAG, "invalid argument");
  dw_gdma_ll_lli_set_block_markers(lli, markers.en_trans_done_intr,
      markers.is_last, markers.is_valid);
  return ESP_OK;
}

esp_err_t dw_gdma_channel_register_event_callbacks(
    dw_gdma_channel_handle_t chan,
    dw_gdma_event_callbacks_t *cbs,
    void *user_data)
{
  ESP_RETURN_ON_FALSE(chan && cbs, ESP_ERR_INVALID_ARG, TAG,
                      "invalid argument");

  dw_gdma_group_t *group = chan->group;
  dw_gdma_hal_context_t *hal = &group->hal;
  int chan_id = chan->chan_id;

  /* Lazy install interrupt service */

  if (chan->cpuint < 0)
    {
      ESP_RETURN_ON_ERROR(
          dw_gdma_install_channel_interrupt(chan), TAG,
          "install interrupt service failed");
    }

  /* Enable interrupt propagation for registered events */

  dw_gdma_ll_channel_enable_intr_propagation(hal->dev, chan_id,
      DW_GDMA_LL_CHANNEL_EVENT_BLOCK_TFR_DONE,
      cbs->on_block_trans_done != NULL);
  dw_gdma_ll_channel_enable_intr_propagation(hal->dev, chan_id,
      DW_GDMA_LL_CHANNEL_EVENT_DMA_TFR_DONE,
      cbs->on_full_trans_done != NULL);
  dw_gdma_ll_channel_enable_intr_propagation(hal->dev, chan_id,
      DW_GDMA_LL_CHANNEL_EVENT_SHADOWREG_OR_LLI_INVALID_ERR,
      cbs->on_invalid_block != NULL);

  chan->user_data = user_data;
  memcpy(&chan->cbs, cbs, sizeof(dw_gdma_event_callbacks_t));
  return ESP_OK;
}

esp_err_t dw_gdma_channel_get_id(dw_gdma_channel_handle_t chan,
                                 int *channel_id)
{
  ESP_RETURN_ON_FALSE(chan && channel_id, ESP_ERR_INVALID_ARG, TAG,
                      "invalid argument");
  *channel_id = chan->chan_id;
  return ESP_OK;
}
